const templates = require('./templates')
const samples = require('./samples')
console.log(process.env.TOKEN)
module.exports = {
    templates,samples,
    token: process.env.TOKEN,
    g_token: process.env.G_TOKEN,
    db_url: process.env.MONGO_URI,
    btns: {
        confirm: '✅ تایید',
        cancel: '❌ انصراف'
    },
    keys: {
        openfacts: '📜 فاکتور های باز',
        monthlyReport: '🌙 گزارش ماهانه',
        postSettleReport: 'گزارش معاملات پس از تسویه',
        semiSettle: 'تسویه موقت',
        packInv: '⚱️موجودی دلار',
        changeInv: '💶 موجودی مالی',
        userInfo: '👤 اطلاعات فردی',
        contact: '👨🏻‍💼ارتباط با ما',
        eccountant: 'حسابداری',
        support: 'پشتیبانی',
        summitResipt: '🏦 ثبت فیش واریزی',
        reqCash: '💶 درخواست وجه',
        reqRESIVEGOLG: 'درخواست تحویل فیزیکی',
        reqCard: '💳 شماره کارت واریز',
        sendDocs: 'ارسال مدارک',
        cardInfo: '💳 شماره کارت شما',
        transactions: '🧮 تراکنش ها',
        help: '📌 راهنما',
        contactManager: '👨🏻‍💼ارتباط با مدیر',
        back: '🔙 بازگشت',
        manage: 'مدیریت ربات',
    },
    adminKeys: {
        commition: '💲 میزان کمیسیون',
        tolerence: '📈 میزان تلورانس',
        quotation: '💷 نرخ مظنه',
        incQuotation: '🔼 مظنه',
        decQuotation: '🔽 مظنه',
        delay: '⌛ اعتبار لفظ',
        basecharge: '💰وجه تضمین',
        settleQuotation: '💸نرخ تسویه',
        nextSettle: '⏰زمان تسویه بعدی',
        activateCashRec: '🔓 بازکردن درخواست وجه',
        deactivateCashRec: '🔐 بستن درخواست وجه',
        increase: '⬆️افزایش',
        decrease: '⬇️ کاهش',
        increaseBotCharge: '💰افزایش موجودی ربات',
        addMember: '👤ثبت عضو جدید',
        setBotCard: 'ثبت کارت واریز 💳',
        charge: '💳موجودی حساب',
        doSettle: '💎اعمال تسویه حساب',
        sendToGroup: '📢ارسال مطلب به گروه',
        sendToUsers: '💬ارسال مطلب به کاربران',
        changeRole: '⭐️تغییر نقش کاربران',
        manageUsers: '👨‍🔧مدیریت کاربران',
        getSettings: '⚙️مشاهده تنظیمات',
        showVips: 'مشاهده کاربران vip',
        showAdmins: 'مشاهده مدیر',
        showEccountant: '⚙️مشاهده حسابدار',
        inviters: '⚙️مشاهده معرف ها',
        setVipOff: 'تنظیم درصد کمیسیون vip',
        activate: '🔓 بازکردن گروه',
        deactivate: '🔐 بستن گروه',
        activateFaker: '🔓 معاملات صوری',
        deactivateFaker: '🔐 معاملات صوری',
        showFac: '👌 نمایش فاکتور در گروه',
        dShowFac: '💣 عدم نمایش فاکتور در گروه',
        dobock: 'اعمال بلوکه',
        giftUser: 'تخصیص اعتبار هدیه 🎁',
        allUsers: '↙️ لیست کاربران',
        activateAuto: '✅ مظنه خودکار',
        deactivateAuto: '🚫 مظنه خودکار',
        viewUser: '👤 برسی حساب کاربر',
        editUser: '👤 ویرایش حساب کاربر',
        sentToUser: '🔁 پیام به کاربر'


    },
    welcomeMessage: `با سلام
 به ربات دلار آذین خوش آمدید`,
    contract: [
        `.................. 🙏 بنام خالق یکتا 🙏..................

        💫 قوانین گروه معاملات مرکزی چهلستون 💫
        
        معاملات در این گروه تضمینی است و مدیران گروه پرداخت سود و زیان معاملات را تضمین میکنند.
        
        حد سود و زیان معاملات ۲میلیون تومان به ازای  هر بسته می باشد (۲۰۰ تومان نوسان) 
        
        حق کمیسیون معاملات ۱۰۰۰۰ تومان به ازاء هر بسته میباشد و با توجه به نوسانات بازار قابل تغییر است، که پس از تصویب و اعلام همگانی اعمال میگردد.
        
        بیعانه برای معامله کردن هر واحد (۱۰۰۰ دلار) دویست هزار تومان ميباشد.
        
        شرایط ثبت و محاسبه معاملات:
        
        تسویه هر روز بر مبنای قیمت دلار هرات و راس ساعت ۱۲:۳۰ روزهای شنبه تا پنجشنبه ( ایام غیر تعطیل ) میباشد.
         عدد تسویه اولین معامله انجام شده امروزی ساعت ۱۲:۳۰ میباشد و اگر معامله‌ای انجام نشد، عددی بین خریدار و فروشنده امروزی که هماهنگ با بقیه اتاق ها میباشد تسویه انجام خواهد شد. در صورت خطا در تسویه توسط اتاق های دیگر مدیریت شخصا عدد تسویه را مشخص می‌کند.
        
        در صورت قطع اینترنت و یا اختلال در سرور تلگرام برای چند ساعت، با مشورت از اعضای محترم گروه، تصمیم مقتضی در خصوص پابرجا بودن معاملات یا کنسل شدن تمام معاملات گرفته خواهد شد و تصمیم نهایی با مدیریت گروه می باشد و کاربران در این خصوص حق اعتراض ندارند.
        
        این تصمیم در خصوص حوادث غیر مترقبه نیز صادق است.
        
        اعتبار هر لفظ یک دقیقه می باشد، و در صورت انجام معامله در تایم به هیچ وجه قابل کنسل شدن نیست مگر با رضایت طرفین.
        
        معاملات خارج از تایم فقط با برکت دو طرف در تایمی که معامله برکت خورده ثبت میشود و در صورت برکت ندادن از طرف مقابل قابل ثبت و پیگیری نیست.
        
        معامله گر در طی تایم معاملات موظف است بصورت متناوب صورتحساب خود را چک کند و در صورت مغایرت با حسابداری هماهنگ کند تا خطای احتمالی برطرف شود.
         
        در موارد ضروری مدیریت اجازه دارد مقررات خاص را برای کنترل گروه و مدیریت سرمایه اعضای گروه اعمال نماید که در این صورت همه اعضا مکلف به رعایت آن قوانین میباشند.
        
        سود و ضرر معاملات به صورت روزانه پرداخت و دریافت می‌شود.
        
         موفق و پرسود باشید 🌹`.trim()
    ],
    role_admin: 'bot-admin',
    role_owner: 'bot-owner',
    role_shared_owner: 'bot-shared-owner',
    role_bot: 'bot-bot',
    role_bot_assistant: 'bot-assist',
    role_member: 'bot-member',
    role_vip: 'bot-vip',
    role_eccountant: 'bot-eccountant',
}