module.exports = {
// billPrev: `🔵 خریدار : x
// 🔴 فروشنده : x
// ✅ تعداد: x قیمت: x ✅
// ⏱ ساعت:  x
// 🔖 شماره حواله: x`,
billPrev : `🔴فروشنده: x
🔵خریدار: x
🔘تعداد: x
💰قیمت: x
📈نوع معامله: x
🔖کد معامله: x
 ♻️ اتاق معاملاتی ارز انلاین`,
settleMsg: `با سلام 
معاملات باز شما در تاریخ x 
    
با نرخ مظنه‌ی x تسویه شد. 
    ✅شما در طول هفته‌ی گذشته، مبلغ x تومان x داشتید. 
`,
blockeMsg: `👤 همکار گرامی «x»

شما دارای x واحد فاکتور باز جدید هستید. بابت بلوکه‌ی این تعداد فاکتور باز، مبلغ x تومان از موجودی مالی شما کسر گردید. 

قابل ذکر است که از این به بعد، بابت نگه‌داری این فاکتور باز هیچ مبلغی از شما کسر نخواهد شد.
`
}